In [6]:
import pandas as pd

In [7]:
data = {
    'Name': ['Darshan','Nishitaba','Krishi','Suchi'],
    'Age' : [20,21,5,2],
    'Salary' : [200000,20000,15000,5000]
}
print(data)

{'Name': ['Darshan', 'Nishitaba', 'Krishi', 'Suchi'], 'Age': [20, 21, 5, 2], 'Salary': [200000, 20000, 15000, 5000]}

In [8]:
df = pd.DataFrame(data)
print(df)

        Name  Age  Salary
0    Darshan   20  200000
1  Nishitaba   21   20000
2     Krishi    5   15000
3      Suchi    2    5000

In [10]:
total_salary = df['Salary'].sum()
print("total salary : ",total_salary)

total salary :  240000

In [11]:
average_age = df['Age'].mean()
print("Average Age : ",average_age)

Average Age :  12.0

In [12]:
max_salary = df['Salary'].max()
print("Maximum Salary : ",max_salary)

Maximum Salary :  200000

In [13]:
min_age = df['Age'].min()
print(min_age)

2

In [15]:
row_count = df.shape[0]
print("Number of Rows : ",row_count)

Number of Rows :  4

In [16]:
df

        Name  Age  Salary
0    Darshan   20  200000
1  Nishitaba   21   20000
2     Krishi    5   15000
3      Suchi    2    5000

In [19]:
df.to_csv("newdata.csv",index=False)